int main()
{
	 char a = 127;  //7f       0111 1111                         127
	 char b = 128;  //80       1000 0000   1111 1111  1000 0000 -128
	 char c = -128; //80       1000 0000   1111 1111  1000 0000 -128
	 char d = -1;   //ff       1111 1111   1000 0000  1000 0001  -1

	 unsigned char e = 256;  //00   0000 0000    0
	 unsigned char f = -1;  //ff    
	 unsigned char g = 255;   //ff  1111 1111  1111 1110 
	                           //                                         

	 //反码表示法规定：正数的反码与其原码相同；负数的反码是对其原码逐位
	 //取反，但符号位除外。
	 //补码表示法规定：正数的补码与其原码相同；负数的补码是在其反码的末位加1

	return 0;
}